#+TITLE: Organize My Life In Plain Text
#+CAPTION: 乱花渐欲迷人眼
#+CAPTION: 笃行克己
#+AUTHOR: 胡琛

* Finance

** Daily Record  
*** 2017/May 
   
**** Day31

     | 支出类别 | 支出明细              | 支出金额 |
     |----------+-----------------------+----------|
     | 早餐     | 蛋黄肉粽、黑米粥      |     8.00 |
     | 午餐     | 鱿鱼、生菜套餐        |    18.00 |
     | 馋       | 芝士草莓              |    24.00 |
     | 药       | 达克宁、棉签          |    26.00 |
     | 晚餐     | (DKC)美式汉堡、冻柠茶 |    68.00 |
     |----------+-----------------------+----------|
     | 合计     |                       |          |

*** 2017/June

**** Day1 

     | 支出类别 | 支出明细                            | 支出金额 |
     |----------+-------------------------------------+----------|
     | 早餐     | (Starbucks) 拿铁、提子多士          |    41.00 |
     | 午餐     | (绿茶) 烤翅、虾仁馄饨               |    34.00 |
     | 晚餐     | (汉堡王) 意式罗勒酱牛肉煲套餐、鸡条 |    49.00 |
     | 杂项     | 毛巾、湿巾、洗面奶                  |    52.00 |
     | 饮料     | 果汁、茶叶蛋、酸奶                  |    22.00 |
     |----------+-------------------------------------+----------|
     | 合计     |                                     | 198.00   |

**** Day2

     | 支出类别 | 支出明细         | 支出金额 |
     |----------+------------------+----------|
     | 午餐     | 馄饨、卤蛋       |    24.00 |
     | 娱乐     | 电影票、饮料     |   221.00 |
     | 馋       | 可爱多           |     4.00 |
     | 馋       | 港奶、奶茶、果汁 |     35.4 |
     | 馋       | 牛肉粉丝汤       |    18.00 |
     | 饮料     | 矿泉水           |     2.00 |
     |----------+------------------+----------|
     | 合计     |                  | 304.4    |

**** Day3
     
     | 支出类别 | 支出明细               | 支出金额 |
     |----------+------------------------+----------|
     | 午餐     | 木耳炒肉               |    18.00 |
     | 下午茶   | 拿铁、猕猴桃汁         |    36.00 |
     | 晚饭     | (DKC) 美式汉堡、冻柠茶 |    68.00 |
     | 娱乐     |                        |   150.00 |
     | 饮料     | 橙汁                   |    18.00 |
     |----------+------------------------+----------|
     | 合计     |                        | 290.00   |

**** Day4

     | 支出类别 | 支出明细                    | 支出金额 |
     |----------+-----------------------------+----------|
     | 午饭     | (老上海) 荠菜虾肉馄饨、卤蛋 |    24.00 |
     |          |                             |          |
     
**** Day27

     | 支出类别 | 支出明细   | 支出金额 |
     |----------+------------+----------|
     | 早餐     | 白粥、面包 |     4.20 |
     | 饮品     | 咖啡       |    20.00 |
     
*** 2017/July
** House Rents    

*** 2017/01

    + 押金： -13200.00
    + 电费： -141.44
    + 首月租金： -6600.00
    + 水费： -33.00
    + 网费： -2379.00
    + 保安介绍费： -1200.00
    + 总额： -23553.44
    + 王雄已缴：20000.00
    + 胡琛已缴：2412.00
    + 李翔已缴：5734.44
    + 王雄结转：9748.85
      20000.00 - 9000.00 (首月租金加押金) - 47.15 (电费) - 11.00 (纯净水) - 793.00 (网费) - 400.00 (保安介绍费) = 9748.85
    + 李翔结转： -316.71 
      5734.44 - 4800 (首月押金加租金) - 47.15 (电费) - 11.00 (纯净水) - 793.00 (网费) - 400 (保安介绍费) = -316.71

*** 2017/02

    + 房租： -6600.00
    + 王雄房门开锁换锁： -160.00
    + 1 月网费： -200.00 (1 月网费是单独计费)
    + 王雄结转：9748.85 - 3000.00(房租) - 67.00(网费) - 160.00(房锁) = 6521.85
    + 李翔结转： -316.71 - 67.00(网费) = -383.71

*** 2017/03
       
    + 房租： -6600.00
    + 物业管理费：789.00
    + 电费：76.84
    + 王雄结转：6521.85 - 3000.00(房租) - 263.00(物业) - 25.61(电费) = 3233.24 
    + 李翔结转：0.00 - 25.61(电费) = -25.61

*** 2017/04
     
    + 房租： -6600.00
    + 王雄结转：3233.24 - 3000(房租) = 233.24
    + 李翔结转：0.00

*** 2017/05

    + 房租： (6 月房租) -6600.00
    + 物业： (3 月到 5 月) -1229.06
    + 电费： (3 月到 5 月) -132.60
    + 王雄结转：233.24 - 3000 - 453.89 = -3220.65
    + 李翔结转：0.00

*** 2017/06

** Book Payment 

   + 总额：12000
   + 2016 年 12 月工资： -3000.00
   + 2017 年 1 月工资： -3000.00
   + 2017 年 2 月工资： -3000.00
   + 其他支出：
     - 牛奶： -100.00 (黄镇海)
     - 咖啡： -200.00 (甄赏)
     - 吃饭： -500.00 (胡琛)
     - 交通： -200.00 (胡琛)
   + 结余：2000.00

* Work

** Tasks
*** DONE 下午与王雄讨论策略
    CLOSED: [2017-06-02 五 13:53] SCHEDULED: <2017-06-01 四 16:00>
    :PROPERTIES:
    :CREATED:  [2017-06-01 四 15:13]
    :END:
    :LOGBOOK:
    CLOCK: [2017-06-01 四 15:13]--[2017-06-01 四 15:16] =>  0:03
    :END:

*** DONE Runge-Kutta Methods
    CLOSED: [2017-06-03 周六 20:17] SCHEDULED: <2017-06-03 周六 15:00>
    :LOGBOOK:
    CLOCK: [2017-06-03 周六 15:00]--[2017-06-03 周六 15:25] =>  0:25
    :END:
*** DONE 学期总结与暑假假期计划
    CLOSED: [2017-06-07 周三 20:32]
    :LOGBOOK:
    CLOCK: [2017-06-07 周三 20:16]--[2017-06-07 周三 20:32] =>  0:16
    :END:
*** DONE 混沌书画图
    CLOSED: [2017-06-09 周五 09:22] SCHEDULED: <2017-06-09 周五 09:00>
    :PROPERTIES:
    :CREATED:  [2017-06-09 周五 08:09]
    :END:
    :LOGBOOK:
    CLOCK: [2017-06-09 周五 08:31]--[2017-06-09 周五 09:22] =>  0:51
    :END:
    
    1. State space diagram
    2. How to generate Lyapunov exponent
    3. Poincare image projection
    4. Bifurcation diagram
    5. Basion of attraction
    
    主要将 State Space of Diagram 调成一致的格式
*** NEXT 海龟策略梳理
    :PROPERTIES:
    :CREATED:  [2017-06-11 周日 13:57]
    :END:
    :LOGBOOK:
    CLOCK: [2017-06-12 周一 10:35]--[2017-06-12 周一 11:00] =>  0:25
    CLOCK: [2017-06-11 周日 14:29]--[2017-06-11 周日 14:54] =>  0:25
    CLOCK: [2017-06-11 周日 13:57]--[2017-06-11 周日 14:22] =>  0:25
    :END:
*** NEXT 混沌书中参考文献与表格处理
    :PROPERTIES:
    :CREATED:  [2017-06-12 周一 14:40]
    :END:
    :LOGBOOK:
    CLOCK: [2017-06-12 周一 21:34]--[2017-06-12 周一 21:59] =>  0:25
    CLOCK: [2017-06-12 周一 14:40]--[2017-06-12 周一 14:52] =>  0:12
    :END:
** Projects

*** DONE Chaos Book [6/6]
    CLOSED: [2017-06-15 周四 16:46] SCHEDULED: <2017-06-16 周五 10:40>
    :PROPERTIES:
    :LAST_REPEAT: [2017-06-15 周四 16:46]
    :END:
    - State "DONE"       from "NEXT"       [2017-06-15 周四 16:46]
    :LOGBOOK:
    CLOCK: [2017-06-10 周六 08:32]--[2017-06-10 周六 08:57] =>  0:25
    CLOCK: [2017-06-09 周五 14:47]--[2017-06-09 周五 15:12] =>  0:25
    CLOCK: [2017-06-09 周五 10:39]--[2017-06-09 周五 11:17] =>  0:38
    CLOCK: [2017-06-06 周二 21:16]--[2017-06-06 周二 21:41] =>  0:25
    CLOCK: [2017-06-06 周二 14:19]--[2017-06-06 周二 14:44] =>  0:25
    CLOCK: [2017-06-01 周四 15:19]--[2017-06-01 周四 15:44] =>  0:25
    CLOCK: [2017-06-01 周四 13:32]--[2017-06-01 周四 13:57] =>  0:25
    CLOCK: [2017-05-31 周三 21:12]--[2017-05-31 周三 21:37] =>  0:25
    :END:

    - [X] One Equilibrium
      $SE_{17}$ does not generate chaos
      $SE_{20}$ does not generate chaos
    - [X] None Equilibrium
    - [X] Any Type Equilibrium
    - [X] Any Number Equilibrium
    - [X] Line Equilibrium
    - [X] Surface Equilibrium

*** DONE Chaos Book V6 [7/7]
    CLOSED: [2017-06-30 五 13:12]
    :LOGBOOK:
    CLOCK: [2017-06-29 周四 11:11]--[2017-06-29 周四 11:37] =>  0:26
    CLOCK: [2017-06-28 周三 16:05]--[2017-06-28 周三 17:05] =>  1:00
    CLOCK: [2017-06-28 周三 14:42]--[2017-06-28 周三 15:04] =>  0:22
    CLOCK: [2017-06-28 周三 09:07]--[2017-06-28 周三 10:03] =>  0:56
    CLOCK: [2017-06-27 周二 20:11]--[2017-06-27 周二 21:49] =>  1:38
    CLOCK: [2017-06-27 二 15:48]--[2017-06-27 二 16:13] =>  0:25
    CLOCK: [2017-06-27 周二 10:14]--[2017-06-27 周二 10:39] =>  0:25
    CLOCK: [2017-06-27 周二 09:14]--[2017-06-27 周二 09:39] =>  0:25
    CLOCK: [2017-06-26 周一 09:59]--[2017-06-26 周一 10:24] =>  0:25
    CLOCK: [2017-06-26 周一 09:28]--[2017-06-26 周一 09:53] =>  0:25
    CLOCK: [2017-06-26 周一 08:41]--[2017-06-26 周一 09:06] =>  0:25
    CLOCK: [2017-06-25 周日 19:40]--[2017-06-25 周日 20:05] =>  0:25
    CLOCK: [2017-06-25 周日 14:29]--[2017-06-25 周日 14:54] =>  0:25
    CLOCK: [2017-06-24 周六 20:46]--[2017-06-24 周六 21:11] =>  0:25
    :END:
    
    - [X] Chapter4 作者信息
    - [X] Chapter5 重新作图 (Part1, Part2)
    - [X] Chapter5 参考文献格式 (时间不好定)
    - [X] Chapter6 参考文献格式 (时间不好定)
    - [X] Chapter7 重写
      - [X] Case 1
      - [X] Case 2
      - [X] Case 3
      - [X] Case 4
      - [X] Case 5
      - [X] Case 6
      - [X] Case 7
      - [X] Case 8
      - [X] Case 9
      - [X] Case 10
      - [X] Case 11
    - [X] Chapter7 作图
    - [X] Chapter5 表格调整
      cannot adjust, waiting 

**** Time Arrangement
     
     2 Days for Re-plot of Chapter5,7; 2 Days for rewrite Chapter 7; One day for author
     info and rescheduled references.

**** Notes
     
     - Chapter5 line and sur equi LE4 --> may wrong
     - Chapter5 line and sur equi LE5~LE9 --> may wrong --> cannot generate chaos
     - LE4 $\dot{z}=x^2-axy-bxy-yz$
     - LE5 cannot be plotted
     
*** NEXT 经典策略梳理 (TB) [50%]

**** DONE 自适应均线 [2/2]
     CLOSED: [2017-06-23 五 10:27]
     :LOGBOOK:
     CLOCK: [2017-06-22 四 13:53]--[2017-06-22 四 14:18] =>  0:25
     CLOCK: [2017-06-22 四 10:57]--[2017-06-22 四 11:22] =>  0:25
     :END:

     - [X] 策略原理梳理
     - [X] TB 代码编写

**** TODO 海龟策略 [0/0]
     
     - [ ] 策略原理梳理
     - [ ] TB 代码编写

*** Chaos Paper Related [0/1] 

    
**** TODO 关于吸引盆 [/]

     - [ ] 阅读吸引盆画法文章
     - [ ] 编写吸引盆画法代码
       
* Personal
  
** Tasks 
   
*** DONE TB 多周期的处理
    CLOSED: [2017-06-04 周日 14:18] SCHEDULED: <2017-06-03 周六 20:20>
    :LOGBOOK:
    CLOCK: [2017-06-03 周六 21:14]--[2017-06-03 周六 21:39] =>  0:25
    CLOCK: [2017-06-03 周六 20:18]--[2017-06-03 周六 20:43] =>  0:25
    :END:
*** NEXT 策略整理
    :PROPERTIES:
    :CREATED:  [2017-06-16 周五 20:27]
    :END:
    :LOGBOOK:
    CLOCK: [2017-06-16 周五 20:27]--[2017-06-16 周五 20:57] =>  0:30
    :END:
** Projects

*** TODO 掘进量化平台学习 [0/0]

*** NEXT Python 机器学习应用 [1/4]

**** DONE Introduction
     CLOSED: [2017-06-22 四 22:17]

**** NEXT 无监督学习 [1/3]
     :LOGBOOK:
     CLOCK: [2017-06-30 五 16:12]--[2017-06-30 五 16:28] =>  0:16
     CLOCK: [2017-06-30 五 15:25]--[2017-06-30 五 15:50] =>  0:25
     CLOCK: [2017-06-30 五 14:48]--[2017-06-30 五 15:13] =>  0:25
     CLOCK: [2017-06-30 五 13:13]--[2017-06-30 五 13:35] =>  0:22
     CLOCK: [2017-06-26 一 14:44]--[2017-06-26 一 15:09] =>  0:25
     CLOCK: [2017-06-26 一 14:00]--[2017-06-26 一 14:25] =>  0:25
     CLOCK: [2017-06-26 周一 10:48]--[2017-06-26 周一 11:13] =>  0:25
     CLOCK: [2017-06-23 五 15:39]--[2017-06-23 五 16:04] =>  0:25
     CLOCK: [2017-06-23 五 14:50]--[2017-06-23 五 15:15] =>  0:25
     CLOCK: [2017-06-22 四 21:02]--[2017-06-22 四 21:04] =>  0:02
     :END:
     
     - [X] 聚类
       - [X] K-Means 算法
       - [X] DBSCAN 算法
     - [ ] 降维
       - [ ] PCA(主成分分析)
     - [ ] 基于聚类的整图分割实例

**** TODO 有监督学习 [/]

**** TODO 强化学习 [/]

* Miscellaneous

** TODOs

** Response

* Habits
